CREATE TABLE public.categories (
category_id serial4 NOT NULL,
category_title varchar(255) NOT NULL,
CONSTRAINT categories_pk PRIMARY KEY (category_id)
);

CREATE TABLE public.ingredients (
ingredient_id serial4 NOT NULL,
ingredient_title varchar(255) NOT NULL,
CONSTRAINT ingredients_pk PRIMARY KEY (ingredient_id)
);

CREATE TABLE public.products (
product_id serial4 NOT NULL,
product_title varchar(255) NOT NULL, -- сделали NOT NULL, так как у товара должно быть имя
price int4 NULL,
category_id_categories int4 NULL,
description text NULL,
image text NULL,
CONSTRAINT products_pk PRIMARY KEY (product_id),
CONSTRAINT products_categories_fk FOREIGN KEY (category_id_categories) REFERENCES public.categories(category_id) ON DELETE SET NULL
);

CREATE TABLE public.product_ingredients (
product_id int4 NOT NULL,
ingredient_id int4 NOT NULL,
CONSTRAINT product_ingredients_pk PRIMARY KEY (product_id, ingredient_id),
CONSTRAINT fk_product FOREIGN KEY (product_id) REFERENCES public.products(product_id) ON DELETE CASCADE,
CONSTRAINT fk_ingredient FOREIGN KEY (ingredient_id) REFERENCES public.ingredients(ingredient_id) ON DELETE CASCADE
);

INSERT INTO public.categories (category_title) VALUES
    ('Роллы/Суши'),      -- 1
    ('Снеки'),           -- 2
    ('Бургеры'),         -- 3
    ('Автопицца'),       -- 4
    ('Удобный перекус'); -- 5

-- Заполнение таблицы ingredients
INSERT INTO public.ingredients (ingredient_title) VALUES
    ('Лосось'),                        -- 1
    ('Копчёный угорь'),                -- 2
    ('Сливочный сыр'),                 -- 3
    ('Огурец'),                        -- 4
    ('Соус унаги'),                    -- 5
    ('Кунжут'),                        -- 6
    ('Креветки'),                      -- 7
    ('Снежный краб'),                  -- 8
    ('Соус Терияки'),                  -- 9
    ('Рис'),                           -- 10
    ('Нори'),                          -- 11
    ('Наггетсы'),                      -- 12
    ('Картофель фри'),                 -- 13
    ('Сыр Моцарелла'),                 -- 14
    ('Куриные крылышки'),              -- 15
    ('Говяжья котлета'),               -- 16
    ('Пшеничная булочка'),             -- 17
    ('Плавленый сыр'),                 -- 18
    ('Томаты'),                        -- 19
    ('Салат айсберг'),                 -- 20
    ('Соус бургер'),                   -- 21
    ('Красный лук'),                   -- 22
    ('Куриная котлета'),               -- 23
    ('Консервированные корнишоны'),    -- 24
    ('Сыр моцарелла мини'),            -- 25
    ('Помидоры черри'),                -- 26
    ('Лосось холодного копчения'),     -- 27
    ('Руккола'),                       -- 28
    ('Соус сливочный'),                -- 29
    ('Тесто'),                         -- 30
    ('Соус сметанный'),                -- 31
    ('Колбаса пепперони'),             -- 32
    ('Бекон'),                         -- 33
    ('Карбонад'),                      -- 34
    ('Черная тобико'),                 -- 35
    ('Соус манго спайс'),              -- 36
    ('Копченная курица'),              -- 37
    ('Темпура'),                       -- 38
    ('Соус Манго-чили');     

INSERT INTO public.products (product_title, price, category_id_categories) VALUES
    -- Роллы/Суши (category_id = 1)
    ('ролл Джакарта',                    NULL, 1),  -- 1
    ('ролл Катана',                      NULL, 1),  -- 2
    ('ролл Филадельфия классика',        NULL, 1),  -- 3
    -- Снеки (category_id = 2)
    ('Снек бокс маленький',              NULL, 2),  -- 4
    ('Сырные палочки фри 6 шт',          NULL, 2),  -- 5
    ('острые Крылья баффало 6 шт',       NULL, 2),  -- 6
    -- Бургеры (category_id = 3)
    ('бургер Классика',                  NULL, 3),  -- 7
    ('Чикенбургер',                      NULL, 3),  -- 8
    ('Чизбургер',                        NULL, 3),  -- 9
    -- Автопицца (category_id = 4)
    ('пицца с копченым лососем',         NULL, 4),  -- 10
    ('пицца Сливочная пепперони',        NULL, 4),  -- 11
    ('пицца Карбонара',                  NULL, 4),  -- 12
    -- Удобный перекус (category_id = 5)
    ('суши-бургер с копченым лососем',   NULL, 5),  -- 13
    ('Сэндвич-ролл темпура с курицей',   NULL, 5),  -- 14
    ('сэндвич-ролл С креветкой',         NULL, 5);  -- 15

INSERT INTO public.product_ingredients (product_id, ingredient_id) VALUES
    (1, 1), (1, 2), (1, 3), (1, 4), (1, 5), (1, 6),
    (2, 7), (2, 8), (2, 3), (2, 4), (2, 9), (2, 6), (2, 10), (2, 11),
    (3, 1), (3, 3), (3, 10), (3, 11),
    (4, 12), (4, 13),
    (5, 14),
    (6, 15), (6, 9), (6, 6),
    (7, 16), (7, 17), (7, 18), (7, 19), (7, 20), (7, 21), (7, 22),
    (8, 23), (8, 17), (8, 19), (8, 20), (8, 24), (8, 18), (8, 21),
    (9, 16), (9, 17), (9, 18), (9, 24), (9, 21),
    (10, 7), (10, 25), (10, 26), (10, 27), (10, 28), (10, 9), (10, 29), (10, 14), (10, 30),
    (11, 30), (11, 29), (11, 31), (11, 14), (11, 32),
    (12, 30), (12, 29), (12, 31), (12, 14), (12, 33), (12, 34), (12, 22),
    (13, 10), (13, 11), (13, 3), (13, 35), (13, 4), (13, 20), (13, 27), (13, 36), (13, 9),
    (14, 10), (14, 11), (14, 18), (14, 3), (14, 37), (14, 4), (14, 36), (14, 9), (14, 38),
    (15, 7), (15, 39), (15, 4), (15, 3), (15, 10), (15, 11);



ролл Джакарта - Роллы/Суши
Лосось, копчёный угорь, сливочный сыр, огурец, соус унаги, кунжут

ролл Катана - Роллы/Суши
Креветки, снежный краб, сливочный сыр, огурец, соус Терияки, кунжут, рис, нори

ролл Филадельфия классика - Роллы/Суши
Лосось, сливочный сыр, рис, нори 

Снек бокс маленький - Снеки
Наггетсы 5шт, картофель фри мал.

Сырные палочки фри 6 шт - Снеки
Сыр Моцарелла

острые Крылья баффало 6 шт - Снеки
Куриные крылышки (крыло цыплёнка, вода, подсолнечное масло, сахар, кукурузный крахмал, рисовый крахмал, соль, сушеные овощи, томаты, чеснок, специи: перец чили, паприка, чёрный перец, белый перец, сухой глюкозный сироп, дрожжевой экстракт (содержит ячмень), экстракт жгучего перца, петрушка, краситель, молочная сыворотка, натуральный ароматизатор (содержит горчицу), соус Терияки, кунжут

бургер Классика - Бургеры
говяжья котлета, пшеничная булочка, плавленый сыр, томаты, салат айсберг, соус бургер, красный лук

Чикенбургер - Бургеры
куриная котлета, пшеничная булочка, томат, салат Айсберг, консервированные корнишоны, плавленый сыр, соус Бургер (майонез, кетчуп, сок лимона, дижонская горчица) 

Чизбургер - Бургеры
говяжья котлета, пшеничная булочка, плавленый сыр, консервированные корнишоны, соус Бургер (майонез, кетчуп, сок лимона, дижонская горчица)

пицца с копченым лососем - Автопицца
диаметр пиццы 33 см , креветки, сыр моцарелла мини, помидоры черри, лосось холодного копчения, руккола, соус терияки, соус сливочный, сыр моцарелла, тесто

пицца Сливочная пепперони - Автопицца
тесто, соус сливочный, соус сметанный, сыр моцарелла, колбаса пепперони

пицца Карбонара - Автопицца
тесто, соус сливочный, соус сметанный, сыр моцарелла, бекон, карбонад, красный лук

суши-бургер с копченым лососем - Удобный перекус
рис, нори, сливочный сыр, черная тобико, огурец, салат айсберг, лосось холодного копчения, соус манго спайс, соус терияки

Сэндвич-ролл темпура с курицей - Удобный перекус
рис, нори, плавленый сыр,  сливочный сыр, копченная курица, огурец, соус манго спайс, соус терияки, темпура

сэндвич-ролл С креветкой - Удобный перекус
Креветки, соус Манго-чили, огурец, сливочный сыр, рис, нори


